app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "dan@dan.com"], ["password_digest", "$2a$10$29SxWwdHsZKyG5VW0Zo3l.MetY05L8LNIY/otEnv2Pu4nJXF2YaoK"], ["created_at", 2017-02-16 12:40:33 UTC], ["updated_at", 2017-02-16 12:40:33 UTC]]

  def login
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dan@dan.com"], ["LIMIT", 1]]