app/controllers/suits_controller.rb

  def index
    @suits = Suit.all
---
SELECT "suits".* FROM "suits"

    def set_suit
      @suit = Suit.find(params[:id])
---
SELECT  "suits".* FROM "suits" WHERE "suits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]